{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":1,"content":"[BOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":2,"content":"[EOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true,"use_regex":true},"post_processor":null,"decoder":null,"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"byte_fallback":false,"ignore_merges":false,"vocab":{"[PAD]":0,"[BOS]":1,"[EOS]":2,"!":3,"&":4,"'":5,"(":6,")":7,"*":8,"+":9,",":10,"-":11,".":12,"/":13,"0":14,"1":15,"2":16,"3":17,"4":18,"5":19,"6":20,"7":21,"8":22,"9":23,":":24,";":25,"<":26,"=":27,">":28,"A":29,"B":30,"C":31,"D":32,"E":33,"F":34,"G":35,"H":36,"I":37,"J":38,"K":39,"L":40,"M":41,"N":42,"O":43,"P":44,"Q":45,"R":46,"S":47,"T":48,"U":49,"V":50,"W":51,"X":52,"Y":53,"Z":54,"[":55,"\\":56,"]":57,"^":58,"_":59,"a":60,"b":61,"c":62,"d":63,"e":64,"f":65,"g":66,"h":67,"i":68,"j":69,"k":70,"l":71,"m":72,"n":73,"o":74,"p":75,"q":76,"r":77,"s":78,"t":79,"u":80,"v":81,"w":82,"x":83,"y":84,"z":85,"{":86,"|":87,"}":88,"~":89,"Ċ":90,"č":91,"Ġ":92,"Ġ}":93,"Ġ{":94,"Ġ\\":95,"Ġ^":96,"Ġ_":97,"Ġ2":98,"Ġ)":99,"Ġ(":100,"Ġ-":101,"Ġ1":102,"Ġ=":103,"Ġ,":104,"ra":105,"čĊ":106,"ri":107,"rac":108,"Ġ+":109,"frac":110,"ta":111,"me":112,"Ġz":113,"ar":114,"al":115,"de":116,"ma":117,"Ġ\\,":118,"le":119,"Ġd":120,"Ġi":121,"Ġ0":122,"pri":123,"prime":124,"si":125,"ph":126,"ti":127,"Ġx":128,"Ġ~":129,"Ġ.":130,"Ġg":131,"mu":132,"Ġe":133,"th":134,"ft":135,"eta":136,"gh":137,"righ":138,"left":139,"right":140,"Ġ3":141,"Ġs":142,"in":143,"Ġt":144,"lde":145,"tilde":146,"bar":147,"Ġn":148,"nu":149,"lta":150,"Ġp":151,"am":152,"Ġm":153,"math":154,"Ġk":155,"Ġl":156,"delta":157,"phi":158,"psi":159,"Ġ4":160,"Ġr":161,"alph":162,"alpha":163,"ĠA":164,"Ġj":165,"hi":166,"qu":167,"rm":168,"Ġa":169,"Ġc":170,"int":171,"mathrm":172,"Ġy":173,"Phi":174,"ad":175,"cal":176,"da":177,"ĠL":178,"Ġf":179,"quad":180,"gma":181,"ĠD":182,"Ġ\\;":183,"ĠR":184,"Ġu":185,"sigma":186,"theta":187,"gle":188,"ngle":189,"pi":190,"Ġ/":191,"Ġq":192,"Ġ|":193,"par":194,"rt":195,"ĠM":196,"Ġ\\!":197,"tial":198,"partial":199,"bda":200,"qrt":201,"sqrt":202,"amma":203,"ambda":204,"er":205,"ga":206,"ĠJ":207,"mega":208,"beta":209,"do":210,"ĠB":211,"ĠN":212,"Ġ]":213,"dot":214,"gamma":215,"Ġ*":216,"ĠE":217,"ĠK":218,"ĠS":219,"Ġ[":220,"ho":221,"omega":222,"rho":223,"su":224,"ĠT":225,"Ġb":226,"tau":227,"sum":228,"lambda":229,"Ġ&":230,"ĠG":231,"ĠP":232,"Ġo":233,"ray":234,"array":235,"la":236,"Ġ5":237,"ĠH":238,"ĠV":239,"rangle":240,"qquad":241,"Ġ;":242,"Ġ\\\\":243,"epsi":244,"gg":245,"lo":246,"ĠF":247,"Ġ\\:":248,"dagg":249,"langle":250,"epsilo":251,"dagger":252,"epsilon":253,"at":254,"ex":255,"hat":256,"ig":257,"var":258,"Ġ8":259,"ĠU":260,"Lambda":261,"be":262,"ci":263,"en":264,"gin":265,"rc":266,"xi":267,"Ġ6":268,"Ġ:":269,"Ġ>":270,"ĠC":271,"ĠQ":272,"ĠW":273,"sin":274,"exp":275,"begin":276,"circ":277,"end":278,"De":279,"Pi":280,"brac":281,"ber":282,"mber":283,"no":284,"pm":285,"st":286,"zeta":287,"Ġ9":288,"Ġ<":289,"ĠX":290,"ĠZ":291,"Ġh":292,"fty":293,"infty":294,"number":295,"Delta":296,"brace":297,"nonumber":298,"Big":299,"Gamma":300,"Omega":301,"Si":302,"\\{":303,"\\}":304,"bo":305,"big":306,"co":307,"dmath":308,"lin":309,"ldmath":310,"ov":311,"ve":312,"Ġ!":313,"ĠI":314,"Ġw":315,"Ġ\\}":316,"erlin":317,"dots":318,"sinh":319,"Sigma":320,"boldmath":321,"cos":322,"overlin":323,"overline":324,"Psi":325,"ab":326,"ap":327,"ast":328,"bf":329,"chi":330,"equ":331,"iv":332,"ide":333,"kap":334,"ll":335,"lbrace":336,"nab":337,"pa":338,"rbrace":339,"sp":340,"tst":341,"wide":342,"yle":343,"Ġ\\{":344,"Ġ\\|":345,"mes":346,"sim":347,"times":348,"varphi":349,"varpi":350,"Bigr":351,"vec":352,"cosh":353,"equiv":354,"kappa":355,"nabla":356,"tstyle":357,"widetilde":358,"\\,":359,"angle":360,"cri":361,"cdots":362,"ell":363,"fo":364,"ldots":365,"od":366,"op":367,"oint":368,"pr":369,"ptstyle":370,"scri":371,"tri":372,"tex":373,"up":374,"Ġ'":375,"Ġ7":376,"ĠY":377,"Ġv":378,"rall":379,"meq":380,"simeq":381,"mathop":382,"varrho":383,"varepsilon":384,"Bigl":385,"bigl":386,"bigr":387,"bigtri":388,"vert":389,"angleup":390,"forall":391,"prod":392,"scriptstyle":393,"textstyle":394,"bigtriangleup":395},"merges":[["Ġ","}"],["Ġ","{"],["Ġ","\\"],["Ġ","^"],["Ġ","_"],["Ġ","2"],["Ġ",")"],["Ġ","("],["Ġ","-"],["Ġ","1"],["Ġ","="],["Ġ",","],["r","a"],["č","Ċ"],["r","i"],["ra","c"],["Ġ","+"],["f","rac"],["t","a"],["m","e"],["Ġ","z"],["a","r"],["a","l"],["d","e"],["m","a"],["Ġ\\",","],["l","e"],["Ġ","d"],["Ġ","i"],["Ġ","0"],["p","ri"],["pri","me"],["s","i"],["p","h"],["t","i"],["Ġ","x"],["Ġ","~"],["Ġ","."],["Ġ","g"],["m","u"],["Ġ","e"],["t","h"],["f","t"],["e","ta"],["g","h"],["ri","gh"],["le","ft"],["righ","t"],["Ġ","3"],["Ġ","s"],["i","n"],["Ġ","t"],["l","de"],["ti","lde"],["b","ar"],["Ġ","n"],["n","u"],["l","ta"],["Ġ","p"],["a","m"],["Ġ","m"],["ma","th"],["Ġ","k"],["Ġ","l"],["de","lta"],["ph","i"],["p","si"],["Ġ","4"],["Ġ","r"],["al","ph"],["alph","a"],["Ġ","A"],["Ġ","j"],["h","i"],["q","u"],["r","m"],["Ġ","a"],["Ġ","c"],["in","t"],["math","rm"],["Ġ","y"],["P","hi"],["a","d"],["c","al"],["d","a"],["Ġ","L"],["Ġ","f"],["qu","ad"],["g","ma"],["Ġ","D"],["Ġ\\",";"],["Ġ","R"],["Ġ","u"],["si","gma"],["th","eta"],["g","le"],["n","gle"],["p","i"],["Ġ","/"],["Ġ","q"],["Ġ","|"],["p","ar"],["r","t"],["Ġ","M"],["Ġ\\","!"],["ti","al"],["par","tial"],["b","da"],["q","rt"],["s","qrt"],["am","ma"],["am","bda"],["e","r"],["g","a"],["Ġ","J"],["me","ga"],["b","eta"],["d","o"],["Ġ","B"],["Ġ","N"],["Ġ","]"],["do","t"],["g","amma"],["Ġ","*"],["Ġ","E"],["Ġ","K"],["Ġ","S"],["Ġ","["],["h","o"],["o","mega"],["r","ho"],["s","u"],["Ġ","T"],["Ġ","b"],["ta","u"],["su","m"],["l","ambda"],["Ġ","&"],["Ġ","G"],["Ġ","P"],["Ġ","o"],["ra","y"],["ar","ray"],["l","a"],["Ġ","5"],["Ġ","H"],["Ġ","V"],["ra","ngle"],["q","quad"],["Ġ",";"],["Ġ\\","\\"],["e","psi"],["g","g"],["l","o"],["Ġ","F"],["Ġ\\",":"],["da","gg"],["la","ngle"],["epsi","lo"],["dagg","er"],["epsilo","n"],["a","t"],["e","x"],["h","at"],["i","g"],["v","ar"],["Ġ","8"],["Ġ","U"],["L","ambda"],["b","e"],["c","i"],["e","n"],["g","in"],["r","c"],["x","i"],["Ġ","6"],["Ġ",":"],["Ġ",">"],["Ġ","C"],["Ġ","Q"],["Ġ","W"],["si","n"],["ex","p"],["be","gin"],["ci","rc"],["en","d"],["D","e"],["P","i"],["b","rac"],["b","er"],["m","ber"],["n","o"],["p","m"],["s","t"],["z","eta"],["Ġ","9"],["Ġ","<"],["Ġ","X"],["Ġ","Z"],["Ġ","h"],["ft","y"],["in","fty"],["nu","mber"],["De","lta"],["brac","e"],["no","number"],["B","ig"],["G","amma"],["O","mega"],["S","i"],["\\","{"],["\\","}"],["b","o"],["b","ig"],["c","o"],["d","math"],["l","in"],["l","dmath"],["o","v"],["v","e"],["Ġ","!"],["Ġ","I"],["Ġ","w"],["Ġ\\","}"],["er","lin"],["dot","s"],["sin","h"],["Si","gma"],["bo","ldmath"],["co","s"],["ov","erlin"],["overlin","e"],["P","si"],["a","b"],["a","p"],["a","st"],["b","f"],["c","hi"],["e","qu"],["i","v"],["i","de"],["k","ap"],["l","l"],["l","brace"],["n","ab"],["p","a"],["r","brace"],["s","p"],["t","st"],["w","ide"],["y","le"],["Ġ\\","{"],["Ġ\\","|"],["me","s"],["si","m"],["ti","mes"],["var","phi"],["var","pi"],["Big","r"],["ve","c"],["cos","h"],["equ","iv"],["kap","pa"],["nab","la"],["tst","yle"],["wide","tilde"],["\\",","],["a","ngle"],["c","ri"],["c","dots"],["e","ll"],["f","o"],["l","dots"],["o","d"],["o","p"],["o","int"],["p","r"],["p","tstyle"],["s","cri"],["t","ri"],["t","ex"],["u","p"],["Ġ","'"],["Ġ","7"],["Ġ","Y"],["Ġ","v"],["ra","ll"],["me","q"],["si","meq"],["math","op"],["var","rho"],["var","epsilon"],["Big","l"],["big","l"],["big","r"],["big","tri"],["ve","rt"],["angle","up"],["fo","rall"],["pr","od"],["scri","ptstyle"],["tex","tstyle"],["bigtri","angleup"]]}}