{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":1,"content":"[BOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":2,"content":"[EOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true,"use_regex":true},"post_processor":null,"decoder":null,"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"byte_fallback":false,"ignore_merges":false,"vocab":{"[PAD]":0,"[BOS]":1,"[EOS]":2,"!":3,"&":4,"(":5,")":6,"*":7,"+":8,",":9,"-":10,".":11,"/":12,"0":13,"1":14,"2":15,"3":16,"4":17,"5":18,"6":19,"7":20,"8":21,"9":22,":":23,";":24,"<":25,"=":26,">":27,"A":28,"B":29,"C":30,"D":31,"E":32,"F":33,"G":34,"H":35,"I":36,"K":37,"L":38,"M":39,"N":40,"O":41,"P":42,"Q":43,"R":44,"S":45,"T":46,"U":47,"V":48,"W":49,"X":50,"Y":51,"Z":52,"[":53,"\\":54,"]":55,"^":56,"_":57,"a":58,"b":59,"c":60,"d":61,"e":62,"f":63,"g":64,"h":65,"i":66,"j":67,"k":68,"l":69,"m":70,"n":71,"o":72,"p":73,"q":74,"r":75,"s":76,"t":77,"u":78,"v":79,"w":80,"x":81,"y":82,"z":83,"{":84,"|":85,"}":86,"~":87,"Ċ":88,"č":89,"Ġ":90,"Ġ}":91,"Ġ{":92,"Ġ\\":93,"Ġ_":94,"Ġ=":95,"Ġ)":96,"Ġ(":97,"Ġ^":98,"Ġ1":99,"Ġ2":100,"Ġ-":101,"ex":102,"tex":103,"text":104,"ra":105,"čĊ":106,"Ġt":107,"fra":108,"frac":109,"Ġn":110,"Ġ0":111,"rm":112,"Ġ.":113,"textrm":114,"ft":115,"Ġx":116,"ig":117,"Ġ+":118,"Ġs":119,"ht":120,"rig":121,"right":122,"in":123,"le":124,"Ġ,":125,"Ġ]":126,"Ġ[":127,"Ġe":128,"me":129,"Ġj":130,"ga":131,"mega":132,"ĠN":133,"ar":134,"Ġk":135,"al":136,"left":137,"bf":138,"textbf":139,"Ġf":140,"Ġz":141,"Ġ|":142,"ĠT":143,"Ġm":144,"ro":145,"ta":146,"fty":147,"infty":148,"Ġd":149,"ma":150,"Ġi":151,"pi":152,"Ġ&":153,"Ġc":154,"cal":155,"arro":156,"arrow":157,"ĠX":158,"Ġ3":159,"Ġa":160,"rightarrow":161,"th":162,"ĠP":163,"Ġ~":164,"Ġy":165,"Ġ4":166,"Omega":167,"math":168,"gle":169,"ngle":170,"su":171,"Ġl":172,"sum":173,"omega":174,"ha":175,"Ġr":176,"ĠE":177,"Ġ/":178,"ĠR":179,"Ġb":180,"ĠS":181,"Ġp":182,"Ġ5":183,"el":184,"ĠA":185,"ĠH":186,"rt":187,"int":188,"elta":189,"ĠM":190,"angle":191,"ĠF":192,"pha":193,"ĠL":194,"Ġh":195,"bo":196,"co":197,"alpha":198,"box":199,"eta":200,"ray":201,"array":202,"ed":203,"boxed":204,"Ġ8":205,"lo":206,"Ġo":207,"ĠB":208,"ĠW":209,"bb":210,"mathbb":211,"Ġ6":212,"cos":213,"langle":214,"rangle":215,"Ġ\\\\":216,"hat":217,"Ġ*":218,"Ġ9":219,"sin":220,"Ġu":221,"maths":222,"log":223,"mathsf":224,"delta":225,"ert":226,"Ġ7":227,"nd":228,"ime":229,"qrt":230,"sqrt":231,"hi":232,"Delta":233,"Vert":234,"ap":235,"er":236,"ld":237,"app":238,"ĠQ":239,"ĠY":240,"be":241,"end":242,"gin":243,"begin":244,"sig":245,"Ġg":246,"sigma":247,"phi":248,"tau":249,"Ġ\\{":250,"Ġ\\}":251,"lin":252,"ot":253,"ov":254,"time":255,"Ġw":256,"Ġ\\,":257,"erlin":258,"ots":259,"overlin":260,"times":261,"overline":262,"Le":263,"mma":264,"ftrightarrow":265,"ldots":266,"Leftrightarrow":267,"ĠD":268,"ĠG":269,"rox":270,"approx":271,"theta":272,"ĠI":273,"Ġq":274,"\\{":275,"beta":276,"ĠC":277,"op":278,"or":279,"mathrm":280,"as":281,"ame":282,"era":283,"nu":284,"name":285,"tor":286,"opera":287,"ast":288,"torname":289,"operatorname":290,"lVert":291,"rVert":292,"da":293,"ĠV":294,"zeta":295,"Ġ>":296,"Ġv":297,"ck":298,"pr":299,"Ġ<":300,"ĠK":301,"gamma":302,"prime":303,"ci":304,"rc":305,"circ":306,"tan":307,"Ga":308,"rel":309,"sta":310,"ckrel":311,"Gamma":312,"stackrel":313,"mu":314,"kapp":315,"ĠZ":316,"kappa":317,"textco":318,"lor":319,"textcolor":320,"et":321,"ild":322,"ne":323,"set":324,"tild":325,"und":326,"erset":327,"tilde":328,"underset":329,"am":330,"bda":331,"lam":332,"lambda":333,"ad":334,"qu":335,"vert":336,"quad":337,"\\}":338,"iangle":339,"riangle":340,"triangle":341,"var":342,"dag":343,"triangleq":344,"varphi":345,"ln":346,"pro":347,"ell":348,"prod":349,"Phi":350,"pm":351,"arg":352,"mathcal":353,"ĠO":354,"lvert":355,"parrow":356,"rvert":357,"uparrow":358,"Ġ\\;":359,"Th":360,"ep":361,"ilo":362,"silo":363,"Theta":364,"epsilo":365,"epsilon":366,"dast":367,"fbox":368,"Ġ!":369,"ledast":370,"tag":371,"circledast":372,"ch":373,"eck":374,"fo":375,"ll":376,"Ġ:":377,"ĠU":378,"rall":379,"check":380,"forall":381,"bar":382,"cr":383,"de":384,"do":385,"flo":386,"ge":387,"ide":388,"lu":389,"narrow":390,"oint":391,"wide":392,"wnarrow":393,"exp":394,"mathscr":395,"oplu":396,"downarrow":397,"floor":398,"widehat":399,"oplus":400,"cd":401,"di":402,"ea":403,"em":404,"ho":405,"lfloor":406,"mbo":407,"nt":408,"om":409,"ph":410,"rfloor":411,"rho":412,"sf":413,"sy":414,"sar":415,"vpha":416,"xi":417,"xsar":418,"Ġ;":419,"Ġ\\_":420,"textsf":421,"bold":422,"cdots":423,"div":424,"emph":425,"mbol":426,"ntom":427,"symbol":428,"vphantom":429,"xsarea":430,"boldsymbol":431},"merges":[["Ġ","}"],["Ġ","{"],["Ġ","\\"],["Ġ","_"],["Ġ","="],["Ġ",")"],["Ġ","("],["Ġ","^"],["Ġ","1"],["Ġ","2"],["Ġ","-"],["e","x"],["t","ex"],["tex","t"],["r","a"],["č","Ċ"],["Ġ","t"],["f","ra"],["fra","c"],["Ġ","n"],["Ġ","0"],["r","m"],["Ġ","."],["text","rm"],["f","t"],["Ġ","x"],["i","g"],["Ġ","+"],["Ġ","s"],["h","t"],["r","ig"],["rig","ht"],["i","n"],["l","e"],["Ġ",","],["Ġ","]"],["Ġ","["],["Ġ","e"],["m","e"],["Ġ","j"],["g","a"],["me","ga"],["Ġ","N"],["a","r"],["Ġ","k"],["a","l"],["le","ft"],["b","f"],["text","bf"],["Ġ","f"],["Ġ","z"],["Ġ","|"],["Ġ","T"],["Ġ","m"],["r","o"],["t","a"],["ft","y"],["in","fty"],["Ġ","d"],["m","a"],["Ġ","i"],["p","i"],["Ġ","&"],["Ġ","c"],["c","al"],["ar","ro"],["arro","w"],["Ġ","X"],["Ġ","3"],["Ġ","a"],["right","arrow"],["t","h"],["Ġ","P"],["Ġ","~"],["Ġ","y"],["Ġ","4"],["O","mega"],["ma","th"],["g","le"],["n","gle"],["s","u"],["Ġ","l"],["su","m"],["o","mega"],["h","a"],["Ġ","r"],["Ġ","E"],["Ġ","/"],["Ġ","R"],["Ġ","b"],["Ġ","S"],["Ġ","p"],["Ġ","5"],["e","l"],["Ġ","A"],["Ġ","H"],["r","t"],["in","t"],["el","ta"],["Ġ","M"],["a","ngle"],["Ġ","F"],["p","ha"],["Ġ","L"],["Ġ","h"],["b","o"],["c","o"],["al","pha"],["bo","x"],["e","ta"],["ra","y"],["ar","ray"],["e","d"],["box","ed"],["Ġ","8"],["l","o"],["Ġ","o"],["Ġ","B"],["Ġ","W"],["b","b"],["math","bb"],["Ġ","6"],["co","s"],["l","angle"],["ra","ngle"],["Ġ\\","\\"],["ha","t"],["Ġ","*"],["Ġ","9"],["s","in"],["Ġ","u"],["math","s"],["lo","g"],["maths","f"],["d","elta"],["e","rt"],["Ġ","7"],["n","d"],["i","me"],["q","rt"],["s","qrt"],["h","i"],["D","elta"],["V","ert"],["a","p"],["e","r"],["l","d"],["ap","p"],["Ġ","Q"],["Ġ","Y"],["b","e"],["e","nd"],["g","in"],["be","gin"],["s","ig"],["Ġ","g"],["sig","ma"],["p","hi"],["ta","u"],["Ġ\\","{"],["Ġ\\","}"],["l","in"],["o","t"],["o","v"],["t","ime"],["Ġ","w"],["Ġ\\",","],["er","lin"],["ot","s"],["ov","erlin"],["time","s"],["overlin","e"],["L","e"],["m","ma"],["ft","rightarrow"],["ld","ots"],["Le","ftrightarrow"],["Ġ","D"],["Ġ","G"],["ro","x"],["app","rox"],["th","eta"],["Ġ","I"],["Ġ","q"],["\\","{"],["b","eta"],["Ġ","C"],["o","p"],["o","r"],["math","rm"],["a","s"],["a","me"],["e","ra"],["n","u"],["n","ame"],["t","or"],["op","era"],["as","t"],["tor","name"],["opera","torname"],["l","Vert"],["r","Vert"],["d","a"],["Ġ","V"],["z","eta"],["Ġ",">"],["Ġ","v"],["c","k"],["p","r"],["Ġ","<"],["Ġ","K"],["ga","mma"],["pr","ime"],["c","i"],["r","c"],["ci","rc"],["ta","n"],["G","a"],["r","el"],["s","ta"],["ck","rel"],["Ga","mma"],["sta","ckrel"],["m","u"],["k","app"],["Ġ","Z"],["kapp","a"],["text","co"],["lo","r"],["textco","lor"],["e","t"],["i","ld"],["n","e"],["s","et"],["t","ild"],["u","nd"],["er","set"],["tild","e"],["und","erset"],["a","m"],["b","da"],["l","am"],["lam","bda"],["a","d"],["q","u"],["v","ert"],["qu","ad"],["\\","}"],["i","angle"],["r","iangle"],["t","riangle"],["v","ar"],["da","g"],["triangle","q"],["var","phi"],["l","n"],["p","ro"],["el","l"],["pro","d"],["P","hi"],["p","m"],["ar","g"],["math","cal"],["Ġ","O"],["l","vert"],["p","arrow"],["r","vert"],["u","parrow"],["Ġ\\",";"],["T","h"],["e","p"],["i","lo"],["s","ilo"],["Th","eta"],["ep","silo"],["epsilo","n"],["d","ast"],["f","box"],["Ġ","!"],["le","dast"],["ta","g"],["circ","ledast"],["c","h"],["e","ck"],["f","o"],["l","l"],["Ġ",":"],["Ġ","U"],["ra","ll"],["ch","eck"],["fo","rall"],["b","ar"],["c","r"],["d","e"],["d","o"],["f","lo"],["g","e"],["i","de"],["l","u"],["n","arrow"],["o","int"],["w","ide"],["w","narrow"],["ex","p"],["maths","cr"],["op","lu"],["do","wnarrow"],["flo","or"],["wide","hat"],["oplu","s"],["c","d"],["d","i"],["e","a"],["e","m"],["h","o"],["l","floor"],["m","bo"],["n","t"],["o","m"],["p","h"],["r","floor"],["r","ho"],["s","f"],["s","y"],["s","ar"],["v","pha"],["x","i"],["x","sar"],["Ġ",";"],["Ġ\\","_"],["text","sf"],["bo","ld"],["cd","ots"],["di","v"],["em","ph"],["mbo","l"],["nt","om"],["sy","mbol"],["vpha","ntom"],["xsar","ea"],["bold","symbol"]]}}